### Target Ordinal Encoding

In [2]:
import numpy as np
import pandas as pd

In [4]:
df=pd.DataFrame({ 'city': ['New York','Delhi','Bangalore','Yangon','Yangon','New York','Istanbul','Delhi','New York','Mandalay'],
                  'price': [190,200,210,180,220,320,220,330,450,340]})

In [5]:
df

        city  price
0   New York    190
1      Delhi    200
2  Bangalore    210
3     Yangon    180
4     Yangon    220
5   New York    320
6   Istanbul    220
7      Delhi    330
8   New York    450
9   Mandalay    340

In [6]:
mean_price=df.groupby('city')['price'].mean()

In [7]:
mean_price

city
Bangalore    210.0
Delhi        265.0
Istanbul     220.0
Mandalay     340.0
New York     320.0
Yangon       200.0
Name: price, dtype: float64

In [8]:
df['mean price']=df['city'].map(mean_price)

In [9]:
df

        city  price  mean price
0   New York    190       320.0
1      Delhi    200       265.0
2  Bangalore    210       210.0
3     Yangon    180       200.0
4     Yangon    220       200.0
5   New York    320       320.0
6   Istanbul    220       220.0
7      Delhi    330       265.0
8   New York    450       320.0
9   Mandalay    340       340.0

In [31]:
Football=pd.DataFrame({ 'Team': ['Barcelona','Real Madrid','Liverpool','Barcelona','Mancity','Mancity','Mancity','Real Madrid','Barcelona','Liverpool'],
                  'price': [19920,2200,310,9980,2920,7320,10220,3030,1450,1340]})

In [32]:
Football

          Team  price
0    Barcelona  19920
1  Real Madrid   2200
2    Liverpool    310
3    Barcelona   9980
4      Mancity   2920
5      Mancity   7320
6      Mancity  10220
7  Real Madrid   3030
8    Barcelona   1450
9    Liverpool   1340

In [33]:
mean_value=Football.groupby('Team')['price'].mean()

In [34]:
mean_value

Team
Barcelona      10450.0
Liverpool        825.0
Mancity         6820.0
Real Madrid     2615.0
Name: price, dtype: float64

In [35]:
Football['mean_value']=Football['Team'].map(mean_value)

In [36]:
Football

          Team  price  mean_value
0    Barcelona  19920     10450.0
1  Real Madrid   2200      2615.0
2    Liverpool    310       825.0
3    Barcelona   9980     10450.0
4      Mancity   2920      6820.0
5      Mancity   7320      6820.0
6      Mancity  10220      6820.0
7  Real Madrid   3030      2615.0
8    Barcelona   1450     10450.0
9    Liverpool   1340       825.0